# YOLOv8s detection model — placeholder activation, swapped by run_sweep.py
#
# The `activation:` line is a Python expression that parse_model() in
# Ultralytics' tasks.py will evaluate via `eval(act)`. Because eval() accepts
# full constructor calls, hyperparameters can be passed directly:
#
#   activation: AlphaBlendedEAFReLU(epsilon=0.1, r=0.3)
#
# The sweep runner overwrites this line per configuration; this file holds
# the default (Stage 1 first config).

nc: 9                  # 9 RDD2022 Japan damage classes
depth_multiple: 0.33   # YOLOv8s
width_multiple: 0.50   # YOLOv8s

activation: AlphaBlendedEAFReLU(epsilon=0.1, r=0.3)

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]

head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, C2f, [512, False]]
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, C2f, [256, False]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 3, C2f, [512, False]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 3, C2f, [1024, False]]
  - [[15, 18, 21], 1, Detect, [nc]]
